RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/include/bl702_glb.h
/** @defgroup  GLB_ADC_CLK_TYPE
 *  @{
 */
#define IS_GLB_ADC_CLK_TYPE(type) (((type) == GLB_ADC_CLK_AUDIO_PLL) || \
                                   ((type) == GLB_ADC_CLK_XCLK))

/** @defgroup  GLB_DAC_CLK_TYPE
 *  @{
 */
#define IS_GLB_DAC_CLK_TYPE(type) (((type) == GLB_DAC_CLK_PLL_32M) || \
                                   ((type) == GLB_DAC_CLK_XCLK) ||    \
                                   ((type) == GLB_DAC_CLK_AUDIO_PLL))

/** @defgroup  GLB_DIG_CLK_TYPE
 *  @{
 */
#define IS_GLB_DIG_CLK_TYPE(type) (((type) == GLB_DIG_CLK_PLL_32M) || \
                                   ((type) == GLB_DIG_CLK_XCLK) ||    \
                                   ((type) == GLB_DIG_CLK_AUDIO_PLL))

/** @defgroup  GLB_BT_BANDWIDTH_TYPE
 *  @{
 */
#define IS_GLB_BT_BANDWIDTH_TYPE(type) (((type) == GLB_BT_BANDWIDTH_1M) || \
                                        ((type) == GLB_BT_BANDWIDTH_2M))

/** @defgroup  GLB_UART_SIG_TYPE
 *  @{
 */
#define IS_GLB_UART_SIG_TYPE(type) (((type) == GLB_UART_SIG_0) || \
                                    ((type) == GLB_UART_SIG_1) || \
                                    ((type) == GLB_UART_SIG_2) || \
                                    ((type) == GLB_UART_SIG_3) || \
                                    ((type) == GLB_UART_SIG_4) || \
                                    ((type) == GLB_UART_SIG_5) || \
                                    ((type) == GLB_UART_SIG_6) || \
                                    ((type) == GLB_UART_SIG_7))

/** @defgroup  GLB_UART_SIG_FUN_TYPE
 *  @{
 */
#define IS_GLB_UART_SIG_FUN_TYPE(type) (((type) == GLB_UART_SIG_FUN_UART0_RTS) || \
                                        ((type) == GLB_UART_SIG_FUN_UART0_CTS) || \
                                        ((type) == GLB_UART_SIG_FUN_UART0_TXD) || \
                                        ((type) == GLB_UART_SIG_FUN_UART0_RXD) || \
                                        ((type) == GLB_UART_SIG_FUN_UART1_RTS) || \
                                        ((type) == GLB_UART_SIG_FUN_UART1_CTS) || \
                                        ((type) == GLB_UART_SIG_FUN_UART1_TXD) || \
                                        ((type) == GLB_UART_SIG_FUN_UART1_RXD))

/** @defgroup  GLB_DLL_CLK_TYPE
 *  @{
 */
#define IS_GLB_DLL_CLK_TYPE(type) (((type) == GLB_DLL_CLK_57P6M) || \
                                   ((type) == GLB_DLL_CLK_96M) ||   \
                                   ((type) == GLB_DLL_CLK_144M) ||  \
                                   ((type) == GLB_DLL_CLK_288M) ||  \
                                   ((type) == GLB_DLL_CLK_MMDIV))

/** @defgroup  GLB_GPIO_INT_TRIG_TYPE
 *  @{
 */
#define IS_GLB_GPIO_INT_TRIG_TYPE(type) (((type) == GLB_GPIO_INT_TRIG_NEG_PULSE) || \
                                         ((type) == GLB_GPIO_INT_TRIG_POS_PULSE) || \
                                         ((type) == GLB_GPIO_INT_TRIG_NEG_LEVEL) || \
                                         ((type) == GLB_GPIO_INT_TRIG_POS_LEVEL))

/** @defgroup  GLB_GPIO_INT_CONTROL_TYPE
 *  @{
 */
#define IS_GLB_GPIO_INT_CONTROL_TYPE(type) (((type) == GLB_GPIO_INT_CONTROL_SYNC) || \
                                            ((type) == GLB_GPIO_INT_CONTROL_ASYNC))

/** @defgroup  GLB_DLL_XTAL_TYPE
 *  @{
 */
#define IS_GLB_DLL_XTAL_TYPE(type) (((type) == GLB_DLL_XTAL_NONE) || \
                                    ((type) == GLB_DLL_XTAL_32M) ||  \
                                    ((type) == GLB_DLL_XTAL_RC32M))

/*@} end of group GLB_Public_Constants */

/** @defgroup  GLB_Public_Macros
 *  @{
 */
#define UART_SIG_SWAP_GPIO0_GPIO7   0x01 /* GPIO0-7   uart_sig[0:7] -> uart_sig[4:7], uart_sig[0:3] */
#define UART_SIG_SWAP_GPIO8_GPIO15  0x02 /* GPIO8-15  uart_sig[0:7] -> uart_sig[4:7], uart_sig[0:3] */
#define UART_SIG_SWAP_GPIO16_GPIO22 0x04 /* GPIO16-22 uart_sig[0:7] -> uart_sig[4:7], uart_sig[0:3] */
#define UART_SIG_SWAP_NONE          0x00 /* GPIO0-22  uart_sig[0:7] <- uart_sig[4:7], uart_sig[0:3] */
#define JTAG_SIG_SWAP_GPIO0_GPIO3   0x01 /* GPIO0-3   E21_TMS/E21_TDI/E21_TCK/E21_TDO -> E21_TCK/E21_TDO/E21_TMS/E21_TDI */
#define JTAG_SIG_SWAP_GPIO4_GPIO7   0x02 /* GPIO4-7   E21_TMS/E21_TDI/E21_TCK/E21_TDO -> E21_TCK/E21_TDO/E21_TMS/E21_TDI */
#define JTAG_SIG_SWAP_GPIO8_GPIO11  0x04 /* GPIO8-11  E21_TMS/E21_TDI/E21_TCK/E21_TDO -> E21_TCK/E21_TDO/E21_TMS/E21_TDI */
#define JTAG_SIG_SWAP_GPIO12_GPIO15 0x08 /* GPIO12-15 E21_TMS/E21_TDI/E21_TCK/E21_TDO -> E21_TCK/E21_TDO/E21_TMS/E21_TDI */
#define JTAG_SIG_SWAP_GPIO16_GPIO19 0x10 /* GPIO16-19 E21_TMS/E21_TDI/E21_TCK/E21_TDO -> E21_TCK/E21_TDO/E21_TMS/E21_TDI */
#define JTAG_SIG_SWAP_GPIO20_GPIO22 0x20 /* GPIO20-22 E21_TMS/E21_TDI/E21_TCK/E21_TDO -> E21_TCK/E21_TDO/E21_TMS/E21_TDI */
#define JTAG_SIG_SWAP_NONE          0x00 /* GPIO0-22  E21_TMS/E21_TDI/E21_TCK/E21_TDO <- E21_TCK/E21_TDO/E21_TMS/E21_TDI */

#define GLB_AHB_CLOCK_CPU             (0x0000000000000001UL)
#define GLB_AHB_CLOCK_SDU             (0x0000000000000002UL)
#define GLB_AHB_CLOCK_SEC             (0x0000000000000004UL)
#define GLB_AHB_CLOCK_DMA_0           (0x0000000000000008UL)
#define GLB_AHB_CLOCK_DMA_1           (0x0000000000000010UL)
#define GLB_AHB_CLOCK_DMA_2           (0x0000000000000020UL)
#define GLB_AHB_CLOCK_CCI             (0x0000000000000040UL)
#define GLB_AHB_CLOCK_RF_TOP          (0x0000000000000080UL)
#define GLB_AHB_CLOCK_GPIP            (0x0000000000000100UL)
#define GLB_AHB_CLOCK_TZC             (0x0000000000000200UL)
#define GLB_AHB_CLOCK_EF_CTRL         (0x0000000000000400UL)
#define GLB_AHB_CLOCK_SF_CTRL         (0x0000000000000800UL)
#define GLB_AHB_CLOCK_EMAC            (0x0000000000001000UL)
#define GLB_AHB_CLOCK_UART0           (0x0000000000002000UL)
#define GLB_AHB_CLOCK_UART1           (0x0000000000004000UL)
#define GLB_AHB_CLOCK_UART2           (0x0000000000008000UL)
#define GLB_AHB_CLOCK_UART3           (0x0000000000010000UL)
#define GLB_AHB_CLOCK_UART4           (0x0000000000020000UL)
#define GLB_AHB_CLOCK_SPI             (0x0000000000040000UL)
#define GLB_AHB_CLOCK_I2C             (0x0000000000080000UL)
#define GLB_AHB_CLOCK_PWM             (0x0000000000100000UL)
#define GLB_AHB_CLOCK_TIMER           (0x0000000000200000UL)
#define GLB_AHB_CLOCK_IR              (0x0000000000400000UL)
#define GLB_AHB_CLOCK_CHECKSUM        (0x0000000000800000UL)
#define GLB_AHB_CLOCK_QDEC            (0x0000000001000000UL)
#define GLB_AHB_CLOCK_KYS             (0x0000000002000000UL)
#define GLB_AHB_CLOCK_I2S             (0x0000000004000000UL)
#define GLB_AHB_CLOCK_USB11           (0x0000000008000000UL)
#define GLB_AHB_CLOCK_CAM             (0x0000000010000000UL)
#define GLB_AHB_CLOCK_MJPEG           (0x0000000020000000UL)
#define GLB_AHB_CLOCK_BT_BLE_NORMAL   (0x0000000040000000UL)
#define GLB_AHB_CLOCK_BT_BLE_LP       (0x0000000080000000UL)
#define GLB_AHB_CLOCK_ZB_NORMAL       (0x0000000100000000UL)
#define GLB_AHB_CLOCK_ZB_LP           (0x0000000200000000UL)
#define GLB_AHB_CLOCK_WIFI_NORMAL     (0x0000000400000000UL)
#define GLB_AHB_CLOCK_WIFI_LP         (0x0000000800000000UL)
#define GLB_AHB_CLOCK_BT_BLE_2_NORMAL (0x0000001000000000UL)
#define GLB_AHB_CLOCK_BT_BLE_2_LP     (0x0000002000000000UL)
#define GLB_AHB_CLOCK_EMI_MISC        (0x0000004000000000UL)
#define GLB_AHB_CLOCK_PSRAM0_CTRL     (0x0000008000000000UL)
#define GLB_AHB_CLOCK_PSRAM1_CTRL     (0x0000010000000000UL)
#define GLB_AHB_CLOCK_USB20           (0x0000020000000000UL)
#define GLB_AHB_CLOCK_MIX2            (0x0000040000000000UL)
#define GLB_AHB_CLOCK_AUDIO           (0x0000080000000000UL)
#define GLB_AHB_CLOCK_SDH             (0x0000100000000000UL)

/*@} end of group GLB_Public_Macros */

